##### Handle Categorical Features
###### One Hot Encoding

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('titanic.csv',usecols=['Sex'])

In [3]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [6]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [7]:
df=pd.read_csv('titanic.csv',usecols=['Embarked'])

In [8]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [9]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [10]:
df.dropna(inplace=True)

In [13]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

### Onehotencoding with many categories in a feature

In [15]:
df=pd.read_csv('mercedesbenz.csv',usecols=["X0","X1","X2","X3","X4","X5","X6"])

In [20]:
for feature in df.columns:
    print(feature,':',len(df[feature].unique()))

X0 : 47
X1 : 27
X2 : 44
X3 : 7
X4 : 4
X5 : 29
X6 : 12

In [23]:
df.X1.value_counts().head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [25]:
lst_10 = df.X1.value_counts().head(10).index

In [26]:
lst_10 = list(lst_10)

In [27]:
lst_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [28]:
import numpy as np

for category in lst_10:
    df[category] = np.where(df["X1"] == category , 1 ,0)

In [34]:
df[['X1']+lst_10]

     X1  aa  s  b  l  v  r  i  a  c  o
0     v   0  0  0  0  1  0  0  0  0  0
1     t   0  0  0  0  0  0  0  0  0  0
2     w   0  0  0  0  0  0  0  0  0  0
3     t   0  0  0  0  0  0  0  0  0  0
4     v   0  0  0  0  1  0  0  0  0  0
...  ..  .. .. .. .. .. .. .. .. .. ..
4204  s   0  1  0  0  0  0  0  0  0  0
4205  o   0  0  0  0  0  0  0  0  0  1
4206  v   0  0  0  0  1  0  0  0  0  0
4207  r   0  0  0  0  0  1  0  0  0  0
4208  r   0  0  0  0  0  1  0  0  0  0

[4209 rows x 11 columns]